{
	"@context":"http://schema.org",
	"@type":"Recipe",
	"name":"Mayo-Marinated Chicken With Chimichurri",
	"description":"If the idea of rubbing chicken cutlets with mayo before grilling them leaves you cold, I relate — I felt the same way until I tried it. Now I use mayonnaise as the base for nearly every marinade I use, whether I’m cooking on the grill or in a cast-iron skillet indoors. The magic of mayo is that it helps your other marinade ingredients spread evenly across the surface of the meat, delivering more consistent flavor, while improving browning. (Don’t worry, the cooked meat doesn’t taste like mayo.) In this recipe, that means chicken cutlets that cook through and brown in about four minutes, with deep chimichurri flavor enhanced by a post-grill drizzle of fresh sauce. This recipe will work with nearly any marinade, exactly as written: You could use pesto, salsa verde, bottled barbecue sauce, jarred Thai curry paste, teriyaki sauce or mole, all with equal success.",
	"author":{
	   "@type":"Person",
	   "name":"J. Kenji López-Alt"
	},
	"image":"https://static01.nyt.com/images/2019/10/30/dining/28Kenjirex1/28Kenjirex1-articleLarge.jpg",
	"totalTime":"PT10M",
	"recipeYield":"2 to 4 servings",
	"recipeCuisine":"",
	"recipeCategory":"poultry, main course",
	"keywords":"chicken breast, mayonnaise",
	"aggregateRating":{
	   "@type":"AggregateRating",
	   "ratingValue":4,
	   "ratingCount":2464
	},
	"recipeIngredient":[
	   "4 chicken breast cutlets (4 to 5 ounces each), pounded about 1/4-inch thick",
	   "Kosher salt and ground black pepper",
	   "1/3 cup store-bought or homemade mayonnaise",
	   "1 cup chimichurri (\u003ca href=\"https://cooking.nytimes.com/recipes/1020544-chimichurri\"\u003esee recipe\u003c/a\u003e)"
	],
	"recipeInstructions":[
	   {
		  "@context":"http://schema.org",
		  "@type":"HowToStep",
		  "text":"Season chicken cutlets on both sides with salt and pepper and set aside."
	   },
	   {
		  "@context":"http://schema.org",
		  "@type":"HowToStep",
		  "text":"Whisk together mayonnaise and 1/4 cup chimichurri in a large bowl. Reserve remaining chimichurri. Add chicken cutlets to the mixture and turn to coat. Cook immediately, or for better flavor, transfer to a sealed container and refrigerate for 4 to 24 hours."
	   },
	   {
		  "@context":"http://schema.org",
		  "@type":"HowToStep",
		  "text":"To cook on the grill: Heat a gas or charcoal grill over high heat for 10 minutes. Cook chicken cutlets directly over high heat, turning and flipping occasionally, until just cooked through and lightly charred all over, about 4 to 5 minutes. Transfer chicken to a serving platter. Spoon some of the remaining chimichurri over the chicken and serve the rest in a small bowl on the side."
	   },
	   {
		  "@context":"http://schema.org",
		  "@type":"HowToStep",
		  "text":"To cook in a skillet: Heat a large (12-inch) cast-iron or nonstick skillet over medium-high heat until a drop of water immediately balls up and dances across the surface. Add chicken cutlets in a single layer and cook, swirling them and flipping them occasionally until browned all over and just cooked through, about 4 minutes. Transfer chicken to a serving platter. Spoon some of the remaining chimichurri over the chicken and serve the rest in a small bowl on the side."
	   }
	],
	"isAccessibleForFree":"False",
	"hasPart":{
	   "@type":"WebPageElement",
	   "isAccessibleForFree":"False",
	   "cssSelector":".recipe"
	},
	"publisher":{
	   "@context":"http://schema.org",
	   "@type":"Organization",
	   "name":"NYT Cooking",
	   "url":"https://cooking.nytimes.com",
	   "alternateName":[
		  "nytimes cooking",
		  "New York Times Cooking"
	   ],
	   "image":[
		  {
			 "url":"https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoRed.svg",
			 "height":31,
			 "width":168,
			 "@context":"http://schema.org",
			 "@type":"ImageObject"
		  },
		  {
			 "url":"https://static01.nyt.com/applications/cooking/80b7044/assets/SiteLogoBlack.svg",
			 "height":24,
			 "width":131,
			 "@context":"http://schema.org",
			 "@type":"ImageObject"
		  }
	   ],
	   "sameAs":[
		  "https://www.facebook.com/groups/nytcooks/",
		  "https://www.facebook.com/nytcooking/",
		  "https://www.instagram.com/nytcooking/",
		  "https://twitter.com/nytfood",
		  "https://www.youtube.com/channel/UC1rIOwTqDuWkFj87HZYRFOg"
	   ]
	}
 }